Documents/ПротоколОсмотраПациентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПротоколОсмотраПациентов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщийСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозОсновной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагноз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозСопутствующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагноз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначенияИРекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавОРИТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПротоколОсмотраПациентов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
Объект.Врач = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
Документ = Объект;
ТабличныйДокумент = ПослеЗаписиНа(Документ);
ТабличныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ПослеЗаписиНа(Объект)
Если Объект.Проведен = Истина Тогда
ТабличныйДокумент = Новый ТабличныйДокумент;
Макет = Документы.ПротоколОсмотраПациентов.ПолучитьМакет("Макет");

Шапка = Макет.ПолучитьОбласть("Шапка");
ТабличныйДокумент.Вывести(Шапка);
Информация = Макет.ПолучитьОбласть("Информация");

Информация.Параметры.Пациент = Объект.Пациент;
Информация.Параметры.Возраст = Объект.Возраст;
Информация.Параметры.НомерДокумента = Объект.НомерДокумента;
Информация.Параметры.Палата = Объект.Палата;
Информация.Параметры.ДатаВремя = Объект.ДатаВремя;
Информация.Параметры.Жалобы = Объект.Жалобы;
Информация.Параметры.ОбщийСтатус = Объект.ОбщийСтатус;
Информация.Параметры.ДиагнозОсновной = Объект.ДиагнозОсновной;
Информация.Параметры.ДиагнозСопутствующий = Объект.ДиагнозСопутствующий;
Информация.Параметры.НазначенияИРекомендации = Объект.НазначенияИРекомендации;

ТабличныйДокумент.Вывести(Информация);
Подвал = Макет.ПолучитьОбласть("Подвал");

Подвал.Параметры.Врач = Объект.Врач;
Подвал.Параметры.ЗавОРИТ = Объект.ЗавОРИТ;

ТабличныйДокумент.Вывести(Подвал);

Возврат ТабличныйДокумент;
КонецЕсли;
КонецФункции
